---
kind: method
id: M:Autodesk.Revit.DB.BooleanOperationsUtils.Dispose
source: html/6fa59aa5-9b3b-7e5d-338b-8dbbb8847e4a.htm
---
# Autodesk.Revit.DB.BooleanOperationsUtils.Dispose Method

Releases all resources used by the BooleanOperationsUtils

## Syntax (C#)
```csharp
public void Dispose()
```